import React from "react";
import { Carousel, CarouselItem } from "react-bootstrap";
var notices = [
  "വേലൂർ ഗ്രാമപഞ്ചായത്തിലെ 9 വാർഡുകൾ കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവായിട്ടുണ്ട്. 8 വാർഡുകൾ ഇപ്പോഴും കണ്ടെയ്മെൻ്റ് സോണിൽ തുടരുകയാണ്. നമുക്ക് എല്ലാ വാർഡുകളെയും കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവാക്കേണ്ടതുണ്ട്. അതിനു വേണ്ടി പഞ്ചായത്തിൽ ഇപ്പോൾ നിലനിൽക്കുന്ന നിബന്ധനകളോടെ മുന്നോട്ട് പോകുകയാണ് അഭികാമ്യം. അതിനാൽ എല്ലാവരും , RRT സേവനം ഉപയോഗപ്പെടുത്തി  വീടുകളിൽ നിന്നും പുറത്തിറങ്ങാതെ കോവിഡ് - 19 പ്രതിരോധ പ്രവർത്തനത്തിൽ സഹകരിക്കുന്ന മെന്നും വിനീതമായി അഭ്യർത്ഥിക്കുന്നു. പ്രസിഡണ്ട്  -വേലൂര്‍ ഗ്രാമപഞ്ചായത്ത്",

  "വേലൂർ ഗ്രാമപഞ്ചായത്തിലെ 9 വാർഡുകൾ കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവായിട്ടുണ്ട്. 8 വാർഡുകൾ ഇപ്പോഴും കണ്ടെയ്മെൻ്റ് സോണിൽ തുടരുകയാണ്. നമുക്ക് എല്ലാ വാർഡുകളെയും കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവാക്കേണ്ടതുണ്ട്. അതിനു വേണ്ടി പഞ്ചായത്തിൽ ഇപ്പോൾ നിലനിൽക്കുന്ന നിബന്ധനകളോടെ മുന്നോട്ട് പോകുകയാണ് അഭികാമ്യം. അതിനാൽ എല്ലാവരും , RRT സേവനം ഉപയോഗപ്പെടുത്തി  വീടുകളിൽ നിന്നും പുറത്തിറങ്ങാതെ കോവിഡ് - 19 പ്രതിരോധ പ്രവർത്തനത്തിൽ സഹകരിക്കുന്ന മെന്നും വിനീതമായി അഭ്യർത്ഥിക്കുന്നു. പ്രസിഡണ്ട്  -വേലൂര്‍ ഗ്രാമപഞ്ചായത്ത്",

  "വേലൂർ ഗ്രാമപഞ്ചായത്തിലെ 9 വാർഡുകൾ കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവായിട്ടുണ്ട്. 8 വാർഡുകൾ ഇപ്പോഴും കണ്ടെയ്മെൻ്റ് സോണിൽ തുടരുകയാണ്. നമുക്ക് എല്ലാ വാർഡുകളെയും കണ്ടെയ്മെൻ്റ് സോണിൽ നിന്നും ഒഴിവാക്കേണ്ടതുണ്ട്. അതിനു വേണ്ടി പഞ്ചായത്തിൽ ഇപ്പോൾ നിലനിൽക്കുന്ന നിബന്ധനകളോടെ മുന്നോട്ട് പോകുകയാണ് അഭികാമ്യം. അതിനാൽ എല്ലാവരും , RRT സേവനം ഉപയോഗപ്പെടുത്തി  വീടുകളിൽ നിന്നും പുറത്തിറങ്ങാതെ കോവിഡ് - 19 പ്രതിരോധ പ്രവർത്തനത്തിൽ സഹകരിക്കുന്ന മെന്നും വിനീതമായി അഭ്യർത്ഥിക്കുന്നു. പ്രസിഡണ്ട്  -വേലൂര്‍ ഗ്രാമപഞ്ചായത്ത്",
];

export default function Noticetrail() {
  return (
    <div>
      <Carousel extLabel="false" prevLabel="false">
        {notices.map((ward, index) => {
          return (
            <CarouselItem key={index}>
              <div
                key={index}
                style={{
                  width: "80%",
                  margin: "1rem auto",
                  marginBottom: "3rem",
                }}
              >
                <div className={`class`} key={index}>
                  <div className={`clsas`}>
                    <h3>അറിയിപ്പ്</h3>
                    <p>{ward}</p>
                  </div>
                </div>
              </div>
            </CarouselItem>
          );
        })}
      </Carousel>
    </div>
  );
}
